{
  "title": "Create HAC and HACD Mixed Transfer Transaction",
  "warning": "Warning: Do not enter your private key on this page!",
  "description": "Create an atomic mixed transfer transaction of HAC and HACD. The transaction is atomic, it can only succeed simultaneously and will not allow one party to fail.",
  "address1": "Address One",
  "hacdInput1": "Outgoing HACD, enter a comma-separated list of diamond literal values, max 200",
  "hacAmount1": "Outgoing HAC amount - HAC (unit: piece-:248) can also use 'ㄜ1:248' format, e.g.: '0.25' or 'ㄜ25:246'",
  "address2": "Address Two",
  "hacdInput2": "Outgoing HACD, enter a comma-separated list of diamond literal values, max 200",
  "hacAmount2": "Outgoing HAC amount - HAC (unit: piece-:248) can also use 'ㄜ1:248' format, e.g.: '0.25' or 'ㄜ25:246'",
  "paymentAddress": "Fee Payment Address",
  "exchangeRate": "Fee (Default: ㄜ1:245)",
  "transactionTimeLimit": "Optional: Transaction timestamp, current timestamp will be used if not filled",
  "submitButton": "Confirm Creation of HAC and HACD Atomic Swap Transaction",
  "successTitle": "HAC and HACD Atomic Swap Transaction Created Successfully!",
  "successDescription": "Please copy the [Transaction Body/txbody] content below, complete the signature operation first, then submit the transaction to the online wallet:",
  "copyTxbody": "Copy txbody",
  "copyTxhash": "Copy txhash",
  "viewInExplorer": "View in Block Explorer",
  "fee": "Fee",
  "txhash": "Transaction Hash",
  "timestamp": "Timestamp",
  "txbody": "Transaction Body",
  "instructionsTitle": "Instructions",
  "instructions": [
    "Address One and Address Two are the diamond addresses that both parties need to exchange",
    "Enter the HACD to be exchanged by both parties (special and ordinary diamond exchange)",
    "Leave the HAC output line empty, do not fill it in.",
    "The fee payment address can only be Address One or Address Two",
    "The fee should be filled in a bit more, as it involves 2 transaction transfers.",
    "After confirming creation, a contract will be generated.",
    "Take the contract to the official offline wallet, choose to verify the transaction content, you can view the contract content, after ensuring it's correct, go to the official offline wallet to choose sign transaction, enter the contract, at this time enter the key, click the first execute as needed signature.",
    "The last party to successfully sign will copy the txbody generated by the offline wallet, go to the official website's online wallet transaction sending page, fill in and send to the main network.",
    "The transaction will be confirmed successfully in the next block."
  ],
  "note": "(Note: Each transaction charges a 0.2 HAC fee, please ensure that the HAC balance of the fee payment address is > 0.3 HAC, the 0.2 fee can be viewed on the contract content verification page)",
  "instructionsLink": "Instructions",
  "backToMain": "Back to Main Page"
}