{
  "title": "Create HAC and HACD Mixed Transfer Transaction",
  "description": "Create an atomic mixed transfer transaction of HAC and HACD. The transaction is atomic, it can only succeed simultaneously and will not allow one party to fail.",
  "address1": "Address One",
  "hacdInput1": "Outgoing HACD, enter a comma-separated list of diamond literal values, max 200",
  "hacAmount1": "Outgoing HAC amount - Format, e.g.: '0.1' or '1:248'",
  "address2": "Address Two",
  "hacdInput2": "Outgoing HACD, enter a comma-separated list of diamond literal values, max 200",
  "hacAmount2": "Outgoing HAC amount - Format, e.g.: '0.1' or '1:248'",
  "paymentAddress": "Fee Payment Address",
  "exchangeRate": "Optional: Fee (Default: ㄜ1:245, i.e. 0.001 HAC)",
  "transactionTimeLimit": "Optional: Transaction timestamp, current timestamp will be used if not filled",
  "submitButton": "Confirm Creation of HAC and HACD Atomic Swap Transaction",
  "successTitle": "HAC and HACD Atomic Swap Transaction Created Successfully!",
  "successDescription": "Please copy the [Transaction Body/txbody] content below, complete the signature operation first, then submit the transaction to the online wallet:",
  "copyTxbody": "Copy txbody",
  "copyTxhash": "Copy txhash",
  "viewInExplorer": "View in Block Explorer",
  "fee": "Fee",
  "txhash": "Transaction Hash",
  "timestamp": "Timestamp",
  "txbody": "Transaction Body",
  "instructionsTitle": "Instructions",
  "warning": "Note: Do not enter your private key on this page!",
  "instructions": [
    "1. This transaction is a Hacash contract atomic transaction. The transaction is atomic and can only succeed simultaneously, not allowing one party to fail.",
    "2. The transaction process is: Create contract => Verify contract content => Parties sign the contract => Submit the signed hxbody to the main network",
    "3. About creating the contract:",
    "  a. All types of transactions can be created, but only HACD to HACD exchange, HAC to HACD exchange, one-way HACD transfer, and one-way HAC transfer are supported. HACD to HACD and HAC exchange is not supported.",
    "  b. The fee can be paid from a separate address used solely for fee payment",
    "4. About verifying contract content and signing the contract:",
    "  a. First, download the desktop wallet => https://github.com/hacash/wallet/releases",
    "  b. To verify contract content, click => 'check tx content'",
    "  c. To sign the contract, click => 'sign the tx'",
    "  d. The above operations are all offline",
    "5. Submit the signed contract to the main network, note that all parties need to sign => https://wallet.hacash.org",
    "6. The transaction will be confirmed in the next block, check status after submission => https://wallet.hacash.org"
  ],
  "note": "(Note: Using this website to create a contract incurs a 0.2 HAC fee, please ensure that the HAC balance of the fee payment address is > 0.3 HAC, the 0.2 fee can be viewed on the contract content verification page)",
  "instructionsLink": "Instructions",
  "backToMain": "Back to Main Page",
  "pageTitle": "Hacash Swap Contract",
  "submitToMainnet": "Submit txbody to Main Network",
  "homeLink": "Home"
}