{
  "title": "Создать смешанную транзакцию передачи HAC и HACD",
  "warning": "Предупреждение: Не вводите свой приватный ключ на этой странице!",
  "description": "Создайте атомарную смешанную транзакцию передачи HAC и HACD. Транзакция атомарна, она может быть успешной только одновременно и не позволит одной стороне потерпеть неудачу.",
  "address1": "Адрес Один",
  "hacdInput1": "Исходящий HACD, введите список значений алмазов, разделенных запятыми, максимум 200",
  "hacAmount1": "Исходящая сумма HAC - HAC (единица: штука-:248) также может использовать формат 'ㄜ1:248', например: '0.25' или 'ㄜ25:246'",
  "address2": "Адрес Два",
  "hacdInput2": "Исходящий HACD, введите список значений алмазов, разделенных запятыми, максимум 200",
  "hacAmount2": "Исходящая сумма HAC - HAC (единица: штука-:248) также может использовать формат 'ㄜ1:248', например: '0.25' или 'ㄜ25:246'",
  "paymentAddress": "Адрес оплаты комиссии",
  "exchangeRate": "Комиссия (По умолчанию: ㄜ1:245)",
  "transactionTimeLimit": "Необязательно: Временная метка транзакции, если не заполнено, будет использована текущая временная метка",
  "submitButton": "Подтвердить создание атомарной обменной транзакции HAC и HACD",
  "successTitle": "Атомарная обменная транзакция HAC и HACD успешно создана!",
  "successDescription": "Пожалуйста, скопируйте содержимое [Тело транзакции/txbody] ниже, сначала выполните операцию подписи, затем отправьте транзакцию в онлайн-кошелек:",
  "copyTxbody": "Копировать txbody",
  "copyTxhash": "Копировать txhash",
  "viewInExplorer": "Просмотреть в обозревателе блоков",
  "fee": "Комиссия",
  "txhash": "Хэш транзакции",
  "timestamp": "Временная метка",
  "txbody": "Тело транзакции",
  "instructionsTitle": "Инструкции",
  "instructions": [
    "Адрес Один и Адрес Два - это адреса алмазов, которые стороны хотят обменять",
    "Введите HACD, которые обе стороны хотят обменять (обмен специальных и обычных алмазов)",
    "Оставьте строку вывода HAC пустой, не заполняйте ее.",
    "Адрес оплаты комиссии может быть только Адресом Один или Адресом Два",
    "Комиссию следует указать немного больше, так как она включает 2 транзакции перевода.",
    "При подтверждении создания будет сгенерирован контракт.",
    "Отправьте контракт в официальный оффлайн-кошелек, выберите проверку содержимого транзакции, вы можете просмотреть содержимое контракта, убедившись, что все правильно, затем перейдите в официальный оффлайн-кошелек, выберите подписание транзакции, введите контракт, на этом этапе введите ключ и нажмите на первую кнопку для выполнения необходимой подписи.",
    "Последняя сторона, успешно подписавшая, скопирует txbody, сгенерированный оффлайн-кошельком, перейдет на страницу отправки транзакции онлайн-кошелька на официальном сайте, заполнит и отправит в основную сеть.",
    "Транзакция будет подтверждена в следующем блоке."
  ],
  "note": "(Примечание: За каждую транзакцию взимается комиссия 0.2 HAC, пожалуйста, убедитесь, что баланс HAC адреса оплаты комиссии > 0.3 HAC, комиссию 0.2 можно увидеть на странице проверки содержимого контракта)",
  "instructionsLink": "Инструкции",
  "backToMain": "Вернуться на главную страницу"
}